# Используем официальный образ golang
FROM golang:alpine AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum для получения зависимостей
COPY go.mod go.sum ./

# Загружаем зависимости
RUN go mod download

# Копируем остальные файлы проекта в рабочую директорию
COPY . .

# Собираем приложение
RUN go build -o main .

# Создаем финальный контейнер
FROM alpine:latest

# Устанавливаем tzdata для правильной работы временных зон
RUN apk --no-cache add tzdata

# Устанавливаем рабочую директорию
WORKDIR /root/

# Копируем скомпилированное приложение из предыдущего образа
COPY --from=builder /app/main .

# Определяем порт, который будет использоваться нашим приложением
EXPOSE 8080

# Запускаем приложение
CMD ["./main"]